app/Http/Controllers/Front/AdController.php

select * from `categories` where `categories`.`id` in (1)
select * from `cities` where `cities`.`id` in (1)
---
    public function show($id)
    {
        $ad = Ad::with(['category','city'])->where('id',$id)->where('archived',0)->where('sold',0)->where('published',1)->firstOrFail();
        $related_ads = Ad::with('category')->with('city')->where('published', 1)
            ->where('archived', 0)->where('category_id', $ad->category_id)->WhereNotIn('ads.id', ['id' => $id])
            ->limit(get_setting('related_ads_limit'))->orderBy('premium', 'DESC')->orderBy('published_at', 'DESC')->get();