app/Http/Controllers/Front/AdMessageController.php

    public function index()
    {
        $user = auth()->user();
        $ad_messages = AdMessage::select('ad_id')
//        ->with(['ad'])
            ->where('from_user_id', $user->id)
            ->orWhere('to_user_id', $user->id)
//            ->groupBy('ad_id')
            //->take(20)
            ->orderBy('ad_id')
            ->orderBy('updated_at')
            ->get();
        $user_ad_messages=[];
       if(!$ad_messages->isEmpty()) {

           $first_ad_messages = $ad_messages->first();
---
select `ad_id` from `ad_messages` where `from_user_id` = 1 or `to_user_id` = 1 order by `ad_id` asc, `updated_at` asc