app/Http/Controllers/Front/BalancePackageController.php

select * from `balance_packages` where `active` = 1
---
    public function index(){
        $user =auth()->user();

//        if ($user->paid_balance > 0) {
//            if (!is_null($user->paid_expired_at) && Carbon::parse($user->paid_expired_at)->gt(Carbon::now())) {
//
//                return view('frontend.balance_packages.current');
//            }
//        }
        $balance_packages = BalancePackage::active()->get(); $i=0;

select * from `user_paid_balance_payments` where `user_id` = 1 order by `created_at` desc limit 1
---
    public function currentPackage(){
        $user =auth()->user();
        $current_package = UserPaidBalancePayment::where('user_id',$user->id)->latest()->first(); $i=0;