app/Http/Controllers/Front/CategoryController.php

select * from `categories` where `id` = '1' and `published` = 1 limit 1
select `id` from `categories` where `parent` = '1' and `published` = 1
select `ad_id` from `premium_ads` where `to` >= '2021-05-11 07:46:07' and `category_id` = '1' and `published` = 1
select `id` from `categories` where `parent` in (2, 3, 4, 5, 6, 7, 8, 9) and `published` = 1
select `id` from `categories` where `parent` in (10) and `published` = 1
---
    public function show($id)
    {
        $parent_cats =$this->parentsDNA($id);
        $category = Category::where('id',$id)->where('published',1)->firstOrFail();
        $category_child = Category::where('parent',$id)->where('published',1)->pluck('id')->toArray();

        $premium_ads_is = PremiumAd::where('to', '>=', Carbon::now())->where('category_id',$id)->where('published', 1)->get(['ad_id']);
        $premium_ads=[];
        if(count($premium_ads_is)){

            $premium_ads = Ad::with('category','city')->whereIn('id',$premium_ads_is)->where('published',1)->where('archived',0)->where('sold',0)->orderBy('premium','DESC')->orderBy('published_at','DESC')->get();

        }
//        dd($category_child);
        $id=array($id);
        if(count($category_child)){

            $id = array_merge($id, $category_child);
            $category_child1 = Category::whereIn('parent',$category_child)->where('published',1)->pluck('id')->toArray();
            if(count($category_child1)){
                $id = array_merge($id, $category_child1);
                $category_child2 = Category::whereIn('parent',$category_child1)->where('published',1)->pluck('id')->toArray();

select * from `categories` where `categories`.`id` in (1, 2, 8)
select * from `cities` where `cities`.`id` in (1)
---
            }
        }
//        $normal_ads = Ad::with('category','city')->whereIn('category_id',$id)->whereNotIn('id',$premium_ads_is)->where('published',1)->where('archived',0)->where('sold',0)->orderBy('category_id','ASC')->orderBy('published_at','DESC')->paginate(get_setting('ads_category_limit'));
        $normal_ads = Ad::with('category','city')->whereIn('category_id',$id)->whereNotIn('id',$premium_ads_is)->where('published',1)->where('archived',0)->where('sold',0)->orderBy('published_at','DESC')->paginate(get_setting('ads_category_limit'));

select * from `categories` where `id` = '1' limit 1
---
    public function parentsDNA($id):array
    {
        $d = (Category::with('parentCategory')->where('id',$id)->first());