app/Http/Controllers/Front/HomeController.php

select `ad_id` from `premium_ads` where `to` >= '2021-05-11 07:07:21' and `category_id` = 1 and `published` = 1
select * from `categories` where `categories`.`id` in (1, 2, 8)
select * from `cities` where `cities`.`id` in (1)
---
    public function index()
    {
//        $categories = Category::with('children')->where('parent',NULL)->orWhere('parent',0)->orderBy('order_is')->get();
        //$pages = Page::where('published','1')->orderBy('order_is')->get();->limit(get_setting('ads_home_limit'))
//        $premium_ads = Ad::with('category','city','premium_ad')->where('published',1)->where('archived',0)->where('sold',0)->orderBy('premium','DESC')->orderBy('published_at','DESC')->get();
//        PremiumAd::where
//        $premium_ads = PremiumAd::whereBetween('recur_at', array(Carbon::now(), Carbon::now()->addWeek()))
//            ->where('status', '<', 5)
//
//            ->get();

        //category-->>>home page:'category_id',1
$premium_ads_is = PremiumAd::where('to', '>=', Carbon::now())->where('category_id',1)->where('published', 1)->get(['ad_id']);
        $premium_ads=[];
if(count($premium_ads_is)){

    $premium_ads = Ad::with('category','city')->whereIn('id',$premium_ads_is)->where('published',1)->where('archived',0)->where('sold',0)->orderBy('published_at','ASC')->get();
}
        $normal_ads = Ad::with('category','city')->whereNotIn('id',$premium_ads_is)->where('published',1)->where('archived',0)->where('sold',0)->orderBy('published_at','DESC')->paginate(get_setting('ads_home_limit'));