app/Http/Controllers/Front/UserController.php

select * from `users` where `id` = 1 limit 1
---
    public function edit()
    {
        $user = User::where('id', auth()->user()->id)->firstOrFail();

select `ad_id` from `bookmarks` where (`bookmarks`.`user_id` = 1)
---
    public function favourite()
    {
        $ad_ids = Bookmark::where(['bookmarks.user_id' => auth()->user()->id])
            ->select('ad_id')->get();