app/View/Components/Popup.php

    public function __construct()
    {
        $popup =  Page::where('published', 1)
            ->where('type_is', 'popup')
           ->latest()->first();
---
select * from `pages` where `published` = 1 and `type_is` = 'popup' order by `created_at` desc limit 1