app/Models/Category.php

select * from `categories` where `published` = 1 and `parent` = 1 order by `order_is` asc
---
    public function scopeRootCategories($query)
    {
//        return $query->with('children')->where('published', 1)->where('parent', NULL)->orWhere('parent', 0)->orderBy('order_is')->get();
        return $query->with('children')->where('published', 1)->Where('parent',1)->orderBy('order_is')->get();

select * from `categories` where `published` = 1 and `is_menu` = '1' order by `order_is` asc
---
    public function scopeIsMenu($query)
    {
        return $query->where('published', 1)->where('is_menu', '1')->orderBy('order_is')->get();