app/Models/Slider.php

    public function slider_images()
    {
      return  self::where('published', 1)->limit(get_setting('slider_limit'))->orderBy('order_is')->get();
---
select * from `sliders` where `published` = 1 order by `order_is` asc limit 10