app/Providers/AppServiceProvider.php

    public function boot()
    {
        Schema::defaultStringLength(191);
//        view()->composer('*', function ($view) {
//            $view->with('site_setting', Setting::all()->pluck('var', 'name'));
//        });
        view()->composer([
            'frontend.layouts.master-has-slider',
            'frontend.layouts.single-ad',
            'frontend.layouts.single-category',
            'frontend.categories.index',
            //'frontend.home.index'
        ], function ($view) {
            $view->with('categories', Category::RootCategories())
                ->with('menu_categories', Category::IsMenu())
                ->with('pages',Page::where('published',1)->where('type_is','<>','popup')->orderBy('order_is')->get());
---
select * from `pages` where `published` = 1 and `type_is` <> 'popup' order by `order_is` asc