app/Repositories/BalancePackageRepository.php

    public function all()
    {
        $balancepackages = BalancePackageResource::collection(BalancePackage::active()->get());
---
select * from `balance_packages` where `active` = 1

    public function findById($id)
    {
        $balancepackage = BalancePackageResource::collection(
            BalancePackage::where('id', $id)->active()->get()
        );
---
select * from `balance_packages` where `id` = '1' and `active` = 1