app/Repositories/BookmarkRepository.php

select * from `bookmarks` where (`bookmarks`.`user_id` = 1)
---
    public function all()
    {
        $bookmarks = BookmarkResource::collection(Bookmark::where(['bookmarks.user_id' => auth()->id()])->get());

select * from `bookmarks` where (`bookmarks`.`user_id` = 1) and `id` = '1' limit 1
---
    public function findById($id)
    {
        $bookmark = new BookmarkResource(
            Bookmark::where(['bookmarks.user_id' => auth()->id()])->where('id', $id)->first()
        );