app/Repositories/CategoryRepository.php

select * from `categories` where `published` = 1 order by `order_is` asc
---
    public function all()
    {
        $categories = CategoryResource::collection(Category::where('published', 1)->orderBy('order_is')->get());

select * from `categories` where `published` = 1 and `id` = '1'
---
    public function findById($id)
    {
        $category = CategoryResource::collection(
            Category::where('published', 1)->where('id', $id)->get()
        );