app/Repositories/CityRepository.php

select * from `cities` where `published` = 1
---
    public function all()
    {
        $cities = CityResource::collection(City::where('published', 1)->get());

select * from `cities` where `published` = 1 and `id` = '1'
---
    public function findById($id)
    {

        $city = CityResource::collection(
            City::where('published', 1)->where('id', $id)->get()
        );