app/Repositories/CouponRepository.php

    public function all()
    {
        $cities = CouponResource::collection(Coupon::all());
---
select * from `coupons`

    public function findById($id)
    {
        $coupon = CouponResource::collection(
            Coupon::where('id', $id)->get()
        );
---
select * from `coupons` where `id` = '1'